
Функции:
print() - печатает на экран
input() - запрашивает данные в типе string
int() - преобразует текст и дробные числа в целые числа
str() - преобразует числа в текст
float() - преобразует текст в дробные числа
len() - считает длинну строки

Методы:
str.count(x) - считает, сколько раз x встречается в str
str.index(x) - возвращает индекс первого вхождения x в str
str.rindex() - возвращает индекс последнего вхождения x в str
str.replace(x, y) - меняет все x в str на y
str.reverce() - разворачивает наоборот
str.isdigit() - возвращает True если str это число
str.islower() - возвращает True если str в нижнем регистре
str.isupper() - возвращает True если str в верхнем регистре

Типы данных:
integer - целые числа
string - текст
float - числа с остатком
list - список

Библиотека turtle:
.setup(w, h) - создает поле
.forward(x) - двигаемся вперед на x пикселей
.goto(x, y) - Переносит черепашку в определённые координаты
.left(x) - поворот на лево на x градусов
.right(x) - поворот на право на x градусов
.dot(R, color) - Рисует круг радиуса R, цвета color
.circle(R, k) - Рисует окружность радиуса R на диагональ k
.shape("turtle") - Устанавливает символ черепашки
.pensize(x) - устанавливает размер пера в пикселях
.mainloop() - отображает рисунок
